## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/14399115639)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 11 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]
  * module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry
  * module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]
  * module.kyma_modules.google_artifact_registry_repository.artifact_registry
  * module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]
  * module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]
  * module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]
  * module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]
* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
* Delete
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.writer_service_account["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
      - description            = "modules-internal registry" -> null
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"] will be destroyed
  # (because google_artifact_registry_repository_iam_member.reader_service_accounts is not in configuration)
  - resource "google_artifact_registry_repository_iam_member" "reader_service_accounts" {
      - etag       = "BwYER6YEZ8s=" -> null
      - id         = "projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com" -> null
      - location   = "europe" -> null
      - member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com" -> null
      - project    = "kyma-project" -> null
      - repository = "projects/kyma-project/locations/europe/repositories/modules-internal" -> null
      - role       = "roles/artifactregistry.reader" -> null
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"] will be destroyed
  # (because google_artifact_registry_repository_iam_member.reader_service_accounts is not in configuration)
  - resource "google_artifact_registry_repository_iam_member" "reader_service_accounts" {
      - etag       = "BwYER6YEZ8s=" -> null
      - id         = "projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com" -> null
      - location   = "europe" -> null
      - member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com" -> null
      - project    = "kyma-project" -> null
      - repository = "projects/kyma-project/locations/europe/repositories/modules-internal" -> null
      - role       = "roles/artifactregistry.reader" -> null
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"] will be destroyed
  # (because google_artifact_registry_repository_iam_member.reader_service_accounts is not in configuration)
  - resource "google_artifact_registry_repository_iam_member" "reader_service_accounts" {
      - etag       = "BwYER6YEZ8s=" -> null
      - id         = "projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com" -> null
      - location   = "europe" -> null
      - member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com" -> null
      - project    = "kyma-project" -> null
      - repository = "projects/kyma-project/locations/europe/repositories/modules-internal" -> null
      - role       = "roles/artifactregistry.reader" -> null
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = "modules-internal"
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = "modules-internal"
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = "modules-internal"
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = "modules-internal"
      + role       = "roles/artifactregistry.repoAdmin"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.writer_service_account["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"] will be destroyed
  # (because google_artifact_registry_repository_iam_member.writer_service_account is not in configuration)
  - resource "google_artifact_registry_repository_iam_member" "writer_service_account" {
      - etag       = "BwYER6YEZ8s=" -> null
      - id         = "projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com" -> null
      - location   = "europe" -> null
      - member     = "serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com" -> null
      - project    = "kyma-project" -> null
      - repository = "projects/kyma-project/locations/europe/repositories/modules-internal" -> null
      - role       = "roles/artifactregistry.repoAdmin" -> null
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Development Kyma modules"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dev-kyma-modules"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dev-kyma-modules"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dev-kyma-modules"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dev-kyma-modules"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

  # module.kyma_modules.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Production Kyma modules"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-modules"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "kyma-modules"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "kyma-modules"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-modules"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_reader_access["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_reader_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

Plan: 11 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
              ~ description               = "modules-internal registry" -> ""
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
                # (18 unchanged attributes hidden)
            }
        }
    }
  ~ service_account_keys_rotator                   = {
      ~ service_account_keys_rotator_cloud_run_service   = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "58d30536-eacf-47f4-b578-64eff32a852a" -> "5593aa68-631f-4e82-bcc6-e26e4f91d095"
                      ~ "serving.knative.dev/lastModifier"  = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> "patryk.dobrowolski@sap.com"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 197 -> 198
                  ~ resource_version      = "AAYyLS+hbPQ" -> "AAYybXWB2u8"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-rotator"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-rotator-00197-qz7" -> "service-account-keys-rotator-00198-l7v"
                  ~ latest_ready_revision_name   = "service-account-keys-rotator-00197-qz7" -> "service-account-keys-rotator-00198-l7v"
                  ~ observed_generation          = 197 -> 198
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-rotator-00197-qz7" -> "service-account-keys-rotator-00198-l7v"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
          ~ template                   = [
              ~ {
                  ~ metadata = [
                      ~ {
                          ~ annotations      = {
                              ~ "autoscaling.knative.dev/maxScale" = "100" -> "99"
                            }
                            name             = ""
                            # (6 unchanged attributes hidden)
                        },
                    ]
                    # (1 unchanged attribute hidden)
                },
            ]
            # (5 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator has changed
  ~ resource "google_cloud_run_service" "service_account_keys_rotator" {
        id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
        name                       = "service-account-keys-rotator"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "service-account-keys-rotator-00197-qz7" -> "service-account-keys-rotator-00198-l7v"
              ~ latest_ready_revision_name   = "service-account-keys-rotator-00197-qz7" -> "service-account-keys-rotator-00198-l7v"
              ~ observed_generation          = 197 -> 198
              ~ traffic                      = [
                  ~ {
                      ~ revision_name   = "service-account-keys-rotator-00197-qz7" -> "service-account-keys-rotator-00198-l7v"
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (2 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ effective_annotations = {
              ~ "run.googleapis.com/operation-id"   = "58d30536-eacf-47f4-b578-64eff32a852a" -> "5593aa68-631f-4e82-bcc6-e26e4f91d095"
              ~ "serving.knative.dev/lastModifier"  = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> "patryk.dobrowolski@sap.com"
                # (5 unchanged elements hidden)
            }
          ~ generation            = 197 -> 198
          ~ resource_version      = "AAYyLS+hbPQ" -> "AAYybXWB2u8"
            # (7 unchanged attributes hidden)
        }

      ~ template {
          ~ metadata {
              ~ annotations = {
                  ~ "autoscaling.knative.dev/maxScale" = "100" -> "99"
                }
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":12922,"Program":"tfcmt","SHA1":"4d91410e0e624760346a14bae353458191e6756a","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->